# # Page 79
#
#
# # Ex.:11,12
#
# # Ex.11
# #
# # a = int(input('Enter a number: '))
# # b = int(input('Enter a number: '))
# #
# # c = 0
#
# # for x in range(c,b):
# #     c = c + a
# #     if b < 0:
# #         c = 0 -c
#
#
# # 12
#
#
# for x in range(100, 1000):
#     if x%15 == 11 and x%11 == 9:
#         print(x)

# Ex. 1- 5
#
# 1. Когда End меньше start , или если end > start , если значение переменной идёт на убывание
# 2. Нет, в цикле мы указываем количество повторений
# 3. Цикл с условием может быть бесконечным, по переменной-бесконечным не будет
# 4. Да
# 5. (1024,2,-2);
#
# For x in range (1024,2,-1):
# Print x*x


