# Задача №1
#
# Дан массив:
# int[] array = {9, 2, 6, 4, 5, 12, 7, 8, 6};
# необходимо вывести сумму всех значений массива.
#
# array = [9, 2, 6, 4, 5, 12, 7, 8, 6]
# print(sum(array))




#
# Задача №2
#
# Дан массив:
# int[] array = {9, 2, 6, 4, 5, 12, 7, 8, 6};
# необходимо вывести максимальное значение массива.
#
# array = [9, 2, 6, 4, 5, 12, 7, 8, 6]
# print(max(array))





#
#
# Задача №3
#
# Дан массив:
# int[] array = {9, 2, 6, 4, 5, 12, 7, 8, 6};
# необходимо вывести минимальное значение массива.
# array = [9, 2, 6, 4, 5, 12, 7, 8, 6]
# print(min(array))


#
#
# Задача №4
#
# Дан массив:
# int[] array = {1, 2, 3, 4, 5, 6, 7, 8, 9};
# необходимо вывести среднее арифметическое всех значений массива.


# array = [9, 2, 6, 4, 5, 12, 7, 8, 6]
#
# summa = sum(array)
# lenth = len(array)
#
# average = summa/lenth
#
# print(average)




#
#
# Задача №5
#
# Дан массив:
# int[][] array = {{1, 2, 3, 4, 5}, {6, 7, 8, 9}, {-1, -2, -3, -4}, {-5, -6}};
# необходимо вывести сумму элементов массива.
#


# array = [1, 2, 3, 4, 5], [6, 7, 8, 9], [-1, -2, -3, -4], [-5, -6]
#
# summa = array[0] + array[1] + array[2] + array[3]
#
# print(sum(summa))





#
# Задача №6
#
# Дан массив:
# int[][] array = {{1, 2, 3, 4, 5}, {6, 7, 8, 9}, {-1, -2, -3, -4}, {-5, -6}};
# необходимо вывести максимальное значение массива.
#
# Задача №7
#
# Дан массив:
# int[][] array = {{1, 2, 3, 4, 5}, {6, 7, 8, 9}, {-1, -2, -3, -4}, {-5, -6}};
# необходимо вывести количество элементов в массиве.
#
#
# Экстра задача
#
# Дан массив:
# String[][] array = {{“Привет”, “всем”, “кто”}, {“изучает”, “язык”, “программирования”}, {“java”}};
# необходимо подсчитать количество строк в массиве, которые не содержат буквы “е”.
#
#
# Задача №1
#
# Дана строка:
# String s = “Перестановочный алгоритм быстрого действия”;
# необходимо вывести все буквы “о” из этой строки.
# Для указанной строки ответ будет “ооооо” (или в столбик)
#
#
# Задача №2
#
# Дана строка:
# String s = “Перевыборы выбранного президента”;
# необходимо подсчитать количество букв “е” в строке.
# Для указанной строки ответ будет 4.
#
#
# Задача №3
#
# Дана строка:
# String s = “Посмотрите как Рите нравится ритм”;
# необходимо вывести индексы начала всех подстрок - “рит”, независимо от регистра.
# Для указанной строки ответ будет 6, 15, 29.
#
#
# Задача №1
#
# Необходимо вывести числа от 0 до 15.
#
#
# Задача №2
#
# Необходимо вывести все положительные степени числа 5 которые меньше 10000 (результат возведения в степень меньше 10000).
#
#
# Задача №3
#
# Необходимо вывести все числа кратные 4 между числами 40 и 60 включительно.
# Реализовать 2 варианта:
# использовать конструкцию if для определения кратности (цикл с шагом 1, i = i + 1);
# без использования конструкции if (шаг цикла на ваше усмотрение).
#
